load-test/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 30
      name: "Montée progressive de la charge"
  processor: "./processor.cjs"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Connexion et requêtes protégées"
    flow:
      - post:
          url: "/auth/login"
          json:
            username: "admin"
            password: "password"
          capture:
            json: "$.token"
            as: "token"
      - get:
          url: "/api/v1/store/stock/1"
      - get:
          url: "/api/v1/store/stock/2"
      - get:
          url: "/api/v1/store/stock/3"
      - get:
          url: "/api/v1/store/reports/sales?startDate=2025-06-01&endDate=2025-06-30"
      - put:
          url: "/api/v1/store/products/1"
          json:
            name: "Pomme Golden"
            price: 1.5
            category: "Fruits"
      - get:
          url: "/api/v1/ecommerce/cart"
      - post:
          url: "/api/v1/ecommerce/cart"
          json:
            productId: 1
            quantity: 2
            price: 1.5
            productName: "Pomme Golden"